{
  "backend/main.mo": "Main Motoko actor implementing user profile CRUD and texture preset management (save, get, delete, list) with role-based access control via MixinAuthorization and AccessControl modules.",
  "feature_evidence.json": "Feature evidence report mapping four product features (texture generator, export panel, presets library, visual theme) to their implementing source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of one-line summaries for every frontend source file, serving as a quick reference for the purpose and key details of each component, hook, utility, and page.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes including background, foreground, accent, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the TypeScript module entry point.",
  "frontend/src/App.tsx": "Root app component implementing an auth state machine that routes between loading, login, profile setup, and the main TextureGenerator page based on identity and profile state.",
  "frontend/src/components/AppLayout.tsx": "Application shell providing a fixed header with logo, auth button, and user name display, a scrollable main content area, and a footer with attribution.",
  "frontend/src/components/MaterialSelector.tsx": "Grid UI component for selecting one of eight material categories (metal, wood, stone, fabric, plastic, organic, ceramic, concrete) with amber highlight on the active selection.",
  "frontend/src/components/ParameterControls.tsx": "React component that renders texture parameter controls including a color picker, pattern style selector, and slider rows for roughness, metalness, and other numeric parameters.",
  "frontend/src/components/PresetsLibrary.tsx": "React component that displays a scrollable list of saved texture presets with options to load or delete each, fetching data via React Query hooks.",
  "frontend/src/components/SavePresetDialog.tsx": "Modal dialog component that allows users to name and save the current texture configuration as a reusable preset via a mutation hook.",
  "frontend/src/components/TextureExportPanel.tsx": "Panel component that generates and downloads individual or all PBR texture maps (albedo, normal, roughness, metalness) as PNG files based on current texture parameters.",
  "frontend/src/components/TexturePreview3D.tsx": "3D preview component using React Three Fiber that renders a rotating sphere with procedurally generated PBR texture maps applied as canvas textures.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an Internet Computer actor instance using the current identity, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and texture presets via the backend actor, including get, save, and delete operations.",
  "frontend/src/hooks/useTextureParameters.ts": "Defines texture parameter types, default configs per material type (including extended UI-only types), and a hook for managing and updating texture generation parameters.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines a dark industrial OKLCH-based design token system with custom utility classes for amber accents and panel styling.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/LoginPage.tsx": "Login page component displaying the TextureCraft branding, feature list, and an Internet Identity login button with loading state handling.",
  "frontend/src/pages/ProfileSetupPage.tsx": "One-time profile setup page that prompts the user to enter their name and saves it on-chain via the saveCallerUserProfile mutation before proceeding to the main app.",
  "frontend/src/pages/TextureGenerator.tsx": "Main page component for the texture generator tool, featuring a collapsible left panel for material selection and parameter controls, a central 3D viewport with a randomize/save toolbar, and a collapsible right panel for export and presets.",
  "frontend/src/utils/downloadHelper.ts": "Provides two utility functions: one to trigger a PNG download from an HTMLCanvasElement, and one to build a sanitized filename string from material type and map type.",
  "frontend/src/utils/textureMapGenerator.ts": "Implements procedural texture map generation using Perlin noise and fBm algorithms, with canvas-based rendering for albedo, normal, roughness, and metalness maps based on configurable parameters.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark industrial theme with custom OKLCH color tokens (amber accents, panel/viewport shades), custom fonts, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest tracking schema version, feature status, architectural notes, and pending feature requests for a 3D texture generator tool with PBR material support, export, presets, and a dark industrial UI theme."
}